app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
            <option></option>
            <% Sub.all.each do |sub| %>