app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def is_author_or_moderator?
            @p = Post.find(params[:id])

INSERT INTO "posts" ("title", "url", "content", "author_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
            @post = Post.new(post_params)
            if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "adf"], ["updated_at", "2022-05-13 16:15:01.989979"], ["id", 1]]
---
      def update
            @post = Post.find(params[:id])
            @post.update!(post_params)