app/controllers/subs_controller.rb

      def index
            if params[:query]
                  @subs = Sub.where('title LIKE (?)', '%' + params[:query] + '%')
                  render :index
            else
                  @subs = Sub.all
---
SELECT "subs".* FROM "subs"

      def update
            @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]