app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
      def index
            if params[:query]
                  @users = User.where('username LIKE (?)', '%' + params[:query] + '%')
                  render :index
            else
                  @users = User.all

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at", "picture_url", "birthdate") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
            @user = User.new(user_params)
            if @user.save