app/models/user.rb

    def self.find_by_credentials(username, password)
        @u = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Apple"], ["LIMIT", 1]]